UCB_CS61_lec04.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-10 五 00:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>第四课 Java 中的原始类型</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="yiddishkop" />
<link rel="stylesheet" type="text/css" href="/home/yiddi/git_repos/YIDDI_org_export_theme/theme/org-nav-theme_cache.css" >
</head>
<body>
<div id="content">
<h1 class="title">第四课 Java 中的原始类型</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1d60ec8">1. PRIMITIVE TYPES</a>
<ul>
<li><a href="#org20f74cb">1.1. Boolean Values</a></li>
</ul>
</li>
<li><a href="#org0f16d8b">2. CONDITIONALS</a></li>
<li><a href="#orga4d8fbd">3. THE "return" KEYWORD</a></li>
</ul>
</div>
</div>


<div id="org1d60ec8" class="outline-2">
<h2 id="org1d60ec8"><span class="section-number-2">1</span> PRIMITIVE TYPES</h2>
<div class="outline-text-2" id="text-1">
<p>
Not all variables are references to objects.  Some variables are primitive
types, which store values like "3", "7.2", "h", and "false".  They are:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">byte</td>
<td class="org-left">A 8-bit integer in the range -128&#x2026;127.  (One bit is the sign.)</td>
</tr>

<tr>
<td class="org-left">short</td>
<td class="org-left">A 16-bit integer in the range -32768&#x2026;32767.</td>
</tr>

<tr>
<td class="org-left">int</td>
<td class="org-left">A 32-bit integer in the range -2147483648&#x2026;2147483647.</td>
</tr>

<tr>
<td class="org-left">long</td>
<td class="org-left">A 64-bit integer, range -9223372036854775808&#x2026;9223372036854775807.</td>
</tr>

<tr>
<td class="org-left">double</td>
<td class="org-left">A 64-bit floating-point number like 18.355625430920409.</td>
</tr>

<tr>
<td class="org-left">float</td>
<td class="org-left">A 32-bit floating-point number; has fewer digits of precision.</td>
</tr>

<tr>
<td class="org-left">boolean</td>
<td class="org-left">"true" or "false".</td>
</tr>

<tr>
<td class="org-left">char</td>
<td class="org-left">A single character.</td>
</tr>
</tbody>
</table>

<p>
long values are written with an L on the end:  long x = 43L;
This tells the compiler to internally write out "43" in a 64-bit format.
double and float values must have a decimal point:  double y = 18.0;
float values are written with an f at the end:  float f = 43.9f;
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Object types</th>
<th scope="col" class="org-left">Primitive types</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Variable contains a</td>
<td class="org-left">reference</td>
<td class="org-left">value</td>
</tr>

<tr>
<td class="org-left">How defined?</td>
<td class="org-left">class definition</td>
<td class="org-left">built into Java</td>
</tr>

<tr>
<td class="org-left">How created?</td>
<td class="org-left">"new"</td>
<td class="org-left">"6", "3.4", "true"</td>
</tr>

<tr>
<td class="org-left">How initialized?</td>
<td class="org-left">constructor</td>
<td class="org-left">default (usually zero)</td>
</tr>

<tr>
<td class="org-left">How used?</td>
<td class="org-left">methods</td>
<td class="org-left">operators ("+", "*", etc.)</td>
</tr>
</tbody>
</table>

<p>
Operations on int, long, short, and byte types.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">-x</td>
<td class="org-left">x * y</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">x + y</td>
<td class="org-left">x / y</td>
<td class="org-left">&lt;&#x2013; rounds toward zero (drops the remainder).</td>
</tr>

<tr>
<td class="org-left">x - y</td>
<td class="org-left">x % y</td>
<td class="org-left">&lt;&#x2013; calculates the remainder of x / y.</td>
</tr>
</tbody>
</table>

<p>
Except for "%", these operations are also available for doubles and floats.
Floating-point division ("/") doesn't round to an integer, but it does
round off after a certain number of bits determined by the storage space.
</p>

<p>
The java.lang library has more operations in&#x2026;
</p>

<ul class="org-ul">
<li>the Math class.
x = Math.abs(y);  // Absolute value.  Also see Math.sqrt, Math.sin, etc.</li>
<li>the Integer class.
int x = Integer.parseInt("1984");  // Convert a string to a number.</li>
<li>the Double class.
double d = Double.parseDouble("3.14");</li>
</ul>

<p>
Converting types:  integers can be assigned to variables of longer types.
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span> = <span style="color: #a45bad;">43</span>;
<span style="color: #ce537a; font-weight: bold;">long</span> <span style="color: #7590db;">l</span> = <span style="color: #a45bad;">43</span>;    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Okay, because longs are a superset of ints.</span>
l = i;          <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Okay, because longs are a superset of ints.</span>
i = l;          <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Compiler ERROR.</span>
i = (<span style="color: #ce537a; font-weight: bold;">int</span>) l;    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Okay.</span>
</pre>
</div>

<p>
The string "(int)" is called a cast, and it casts the long into an int.  In the
process, high bits will be lost if l does not fit in the range -2147483648&#x2026;
</p>
<ol class="org-ol">
<li>Java won't let you compile "i = l" because it's trying to protect</li>
</ol>
<p>
you from accidentally creating a nonsense value and a hard-to-find bug.  Java
requires you to explicitly cast longs to ints to show your acknowledgment that
you may be destroying information.
</p>

<p>
Similarly, "float f = 5.5f; double d = f;" is fine, but you need an explicit
cast for "double d = 5.5; float f = (float) d;".  Integers (even longs) can be
directly assigned to floating-point variables (even floats) without a cast, but
the reverse requires a cast because the number is truncated to an integer.
</p>
</div>

<div id="org20f74cb" class="outline-3">
<h3 id="org20f74cb"><span class="section-number-3">1.1</span> Boolean Values</h3>
<div class="outline-text-3" id="text-1-1">
<p>
A boolean value is either "true" or "false".  Booleans have operations of their
own, signified "&amp;&amp;" (and), "||" (or), and "!" (not).
</p>

<pre class="example">
   a    |    b    ||  a &amp;&amp; b  |  a || b  |    !a
==================||==============================
 false  |  false  ||  false   |  false   |   true
 false  |   true  ||  false   |   true   |
  true  |  false  ||  false   |   true   |  false
  true  |   true  ||   true   |   true   |
</pre>

<p>
Boolean values can be specified directly ("true", "false") or be created by
the comparison operators "<code>=", "&lt;", "&gt;", "&lt;</code>", "&gt;=", "!=" (not equal to).
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #ce537a; font-weight: bold;">boolean</span> <span style="color: #7590db;">x</span> = <span style="color: #a45bad;">3</span> == <span style="color: #a45bad;">5</span>;       <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">x is now false.</span>
x = <span style="color: #a45bad;">4</span>.<span style="color: #a45bad;">5</span> &gt;= <span style="color: #a45bad;">4</span>.<span style="color: #a45bad;">5</span>;           <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">x is now true.</span>
x = <span style="color: #a45bad;">4</span> != <span style="color: #a45bad;">5</span> - <span style="color: #a45bad;">1</span>;           <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">x is now false.</span>
x = <span style="color: #a45bad;">false</span> == (<span style="color: #a45bad;">3</span> == <span style="color: #a45bad;">0</span>);    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">x is now true.</span>
</pre>
</div>
</div>
</div>
</div>

<div id="org0f16d8b" class="outline-2">
<h2 id="org0f16d8b"><span class="section-number-2">2</span> CONDITIONALS</h2>
<div class="outline-text-2" id="text-2">
<p>
An "if" statement uses a boolean expression to decide whether to execute a set
of statements.  The form is
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">if</span> (boolValue) {
  statements;
}
</pre>
</div>

<p>
The statements are executed if and only if "boolValue" is "true".  The
parentheses around the boolean expression are required (for no good reason).
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #ce537a; font-weight: bold;">boolean</span> <span style="color: #7590db;">pass</span> = score &gt;= <span style="color: #a45bad;">75</span>;
<span style="color: #4f97d7; font-weight: bold;">if</span> (pass) {
  output(<span style="color: #2d9574;">"You pass CS 61B"</span>);
} <span style="color: #4f97d7; font-weight: bold;">else</span> {
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">The following line executes if and only if score &lt; 75.</span>
  output(<span style="color: #2d9574;">"You are such an unbelievable loser"</span>);
}
</pre>
</div>

<p>
if-then-else clauses can be (1) nested and (2) daisy-chained.  Nesting allows
you to build decision trees.  Daisy-chaining allows you to present more than
two alternatives.  For instance, suppose you want to find the maximum of three
numbers.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">if</span> (x &gt; y) {
  <span style="color: #4f97d7; font-weight: bold;">if</span> (x &gt; z) {
    maximum = x;
  } <span style="color: #4f97d7; font-weight: bold;">else</span> {
    maximum = z;
  }
} <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #4f97d7; font-weight: bold;">if</span> (y &gt; z) {
  maximum = y;
} <span style="color: #4f97d7; font-weight: bold;">else</span> {
  maximum = z;
}
</pre>
</div>
<p>
Some long chains of if-then-else clauses can be simplified by using a "switch"
statement.  "switch" is appropriate only if every condition tests whether a
variable x is equal to some constant.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">switch</span> (month) {        |      <span style="color: #4f97d7; font-weight: bold;">if</span> (month == <span style="color: #a45bad;">2</span>) {
<span style="color: #4f97d7; font-weight: bold;">case</span> <span style="color: #a45bad;">2</span>:                 |        days = <span style="color: #a45bad;">28</span>;
  days = <span style="color: #a45bad;">28</span>;            |      } <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #4f97d7; font-weight: bold;">if</span> ((month == <span style="color: #a45bad;">4</span>) || (month == <span style="color: #a45bad;">6</span>) ||
  <span style="color: #4f97d7; font-weight: bold;">break</span>;                |                 (month == <span style="color: #a45bad;">9</span>) || (month == <span style="color: #a45bad;">11</span>)) {
<span style="color: #4f97d7; font-weight: bold;">case</span> <span style="color: #a45bad;">4</span>:                 |        days = <span style="color: #a45bad;">30</span>;
<span style="color: #4f97d7; font-weight: bold;">case</span> <span style="color: #a45bad;">6</span>:                 |      } <span style="color: #4f97d7; font-weight: bold;">else</span> {
<span style="color: #4f97d7; font-weight: bold;">case</span> <span style="color: #a45bad;">9</span>:                 |        days = <span style="color: #a45bad;">31</span>;
<span style="color: #4f97d7; font-weight: bold;">case</span> <span style="color: #a45bad;">11</span>:                |      }
  days = <span style="color: #a45bad;">30</span>;            |
  <span style="color: #4f97d7; font-weight: bold;">break</span>;
<span style="color: #4f97d7; font-weight: bold;">default</span>:
  days = <span style="color: #a45bad;">31</span>;
  <span style="color: #4f97d7; font-weight: bold;">break</span>;
}                   <span style="color: #2aa1ae; background-color: #292e34;">//  </span><span style="color: #2aa1ae; background-color: #292e34;">These two code fragments do exactly the same thing.</span>
</pre>
</div>

<p>
IMPORTANT:  "break" jumps to the end of the "switch" statement.  If you forget
a break statement, the flow of execution will continue right through past the
next "case" clause, which is why cases 4, 6, and 9 work right.  If month == 12
in the following example, both Strings are printed.
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">switch</span> (month) {
<span style="color: #4f97d7; font-weight: bold;">case</span> <span style="color: #a45bad;">12</span>:
  output(<span style="color: #2d9574;">"It's December."</span>);
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Just keep moving right on through.</span>
<span style="color: #4f97d7; font-weight: bold;">case</span> <span style="color: #a45bad;">1</span>:
<span style="color: #4f97d7; font-weight: bold;">case</span> <span style="color: #a45bad;">2</span>:
<span style="color: #4f97d7; font-weight: bold;">case</span> <span style="color: #a45bad;">11</span>:
  output(<span style="color: #2d9574;">"It's cold."</span>);
}
</pre>
</div>


<p>
However, this is considered bad style, because it's hard to read and
understand.  If there's any chance that other people will need to read or
modify your code (which is the norm when you program for a business), don't
code it like this.  Use break statements in the switch, and use subroutines to
reuse code and clarify the control flow.
</p>

<p>
Observe that the last example doesn't have a "default:" case.  If "month" is
not 1 nor 2 nor 11 nor 12, Java jumps right to the end of the "switch"
statement (just past the closing brace) and continues execution from there.

</p>
</div>
</div>
<div id="orga4d8fbd" class="outline-2">
<h2 id="orga4d8fbd"><span class="section-number-2">3</span> THE "return" KEYWORD</h2>
<div class="outline-text-2" id="text-3">
<p>
Like conditionals, "return" affects the flow of control of a program.  It
causes a method to end immediately, so that control returns to the calling
method.
</p>

<p>
Here's a recursive method that prints the numbers from 1 to x.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">oneToX</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">x</span>) {
  <span style="color: #4f97d7; font-weight: bold;">if</span> (x &lt; <span style="color: #a45bad;">1</span>) {
    <span style="color: #4f97d7; font-weight: bold;">return</span>;
  }
  oneToX(x - <span style="color: #a45bad;">1</span>);
  System.out.println(x);
}
</pre>
</div>

<p>
The return keyword serves a dual purpose:  it is also the means by which a
function returns a value.  A <span class="underline">function</span> is a method that is declared to return
a non-void type.  For instance, here's a function that returns an int.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">daysInMonth</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">month</span>) {
  <span style="color: #4f97d7; font-weight: bold;">switch</span> (month) {
  <span style="color: #4f97d7; font-weight: bold;">case</span> <span style="color: #a45bad;">2</span>:
    <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">28</span>;
  <span style="color: #4f97d7; font-weight: bold;">case</span> <span style="color: #a45bad;">4</span>:
  <span style="color: #4f97d7; font-weight: bold;">case</span> <span style="color: #a45bad;">6</span>:
  <span style="color: #4f97d7; font-weight: bold;">case</span> <span style="color: #a45bad;">9</span>:
  <span style="color: #4f97d7; font-weight: bold;">case</span> <span style="color: #a45bad;">11</span>:
    <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">30</span>;
  <span style="color: #4f97d7; font-weight: bold;">default</span>:
    <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">31</span>;
  }
}

</pre>
</div>

<p>
The "return" value can be an expression.  Some examples:
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">return</span> x + y - z;

<span style="color: #4f97d7; font-weight: bold;">return</span> car.velocity(time);
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
